Documents/ПроверкаЗнанияТребованийОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПроверкаЗнанияТребованийОхраныТруда</Name>
			<BasedOn>
				<xr:Item>Document.ОбучениеСотрудниковОхранеТруда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПроверкиЗнанияТребованийОхраныТрудаСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеСотрудников</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротоколаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РезультатыОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОбучениеСотрудниковОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатПроверкиЗнания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыПроверкиЗнанияПоОхранеТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/РолиЧленовКомиссииОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РолиЧленовКомиссииОхраныТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Председатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧленКомиссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаместительПредседателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыОбученияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ФормыОбученияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/РезультатыПроверкиЗнанияПоОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РезультатыПроверкиЗнанияПоОхранеТруда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Удовлетворительно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неудовлетворительно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбучениеСотрудниковОхранеТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбучениеСотрудниковОхранеТруда</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрограммыОбученияСотрудниковПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПроверкиЗнания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОбучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОбучения</Name>
					<Comment>Внутренняя/внешняя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОбученияПоОхранеТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчебныхЧасов</Name>
					<Comment>АПК:58 различия имени и синонима оправданы. Длительность курса в часах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяДатаПроверкиЗнания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПроверкаЗнанияТребованийОхраныТруда/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		// Заполнение нового документа.
		ЗначенияДляЗаполнения = Новый Структура;
		ЗначенияДляЗаполнения.Вставить("Организация", "Объект.Организация");
		ЗначенияДляЗаполнения.Вставить("Подразделение", "Объект.Подразделение");
		ЗначенияДляЗаполнения.Вставить("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		ПриПолученииДанныхНаСервере();
		
		Если Объект.Комиссия.Количество() = 0 Тогда
			ЗаполнитьСоставКомиссии(Объект.ФормаОбучения, Объект.Комиссия, Объект.Организация, Объект.Подразделение);
		КонецЕсли;
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужбаФормы");
		Модуль.УстановитьПараметрыВыбораСотрудников(ЭтотОбъект, "РезультатыОбученияСотрудник");
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = ОхранаТрудаФормыКлиент.ПараметрыОповещенияДокументов(Объект.РезультатыОбучения);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "Запись_ОплатаПоСреднемуЗаработкуСписком" Тогда
		ЗаполнитьДокументыОтсутствия();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗарплатаКадрыРасширенныйКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	Если ВыбранноеОбучениеСотрудников <> Объект.ОбучениеСотрудников Тогда
		ОбучениеСотрудниковПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗарплатаКадрыРасширенныйКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	Если ВыбранноеОбучениеСотрудников <> Объект.ОбучениеСотрудников Тогда
		ОбучениеСотрудниковПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеСотрудниковПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОбучениеСотрудников) Тогда
		ЗарплатаКадрыРасширенныйКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	КонецЕсли;
	
	ОбучениеСотрудниковПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаОбученияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПрограммаОбучения) И РеквизитыКЗаполнениюЗаняты() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПрограммаОбученияПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,
			НСтр("ru = 'Заполнить документ на основании данных программы обучения? Существующие данные будут утеряны.'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ПрограммаОбученияПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	УстановитьОтображениеНомераПротокола(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыОбучения

&НаКлиенте
Процедура РезультатыОбученияСотрудникПриИзменении(Элемент)
	РезультатыОбученияСотрудникПриИзмененииНаСервере(Элементы.РезультатыОбучения.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыОбученияПриИзменении(Элемент)
	ЗарплатаКадрыРасширенныйКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыОбученияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыОбученияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.РезультатыОбученияРезультатПроверкиЗнания Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РезультатыОбучения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСотрудника(ТекущиеДанные, Поле);
	ОткрытьРабочееМесто(ТекущиеДанные, Поле);
	ОткрытьОбучение(ТекущиеДанные, Поле);
	ОткрытьДокументОтсутствия(ТекущиеДанные, Поле);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыОбученияПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.РезультатыОбучения.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонТекста = НСтр("ru = 'Сотруднику ""%1"" уже оформлено отсутствие ""%2"".
		|Для удаления этой строки необходимо предварительно отменить отсутствие.'");
	Для Каждого ВыделеннаяСтрока Из ОбучениеПоОхранеТрудаФормыКлиент.УпорядоченныеСтрокиКУдалению(ВыделенныеСтроки) Цикл
		ТекущиеДанные = Объект.РезультатыОбучения.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОтсутствия) Тогда
			ТекстСообщения = СтрШаблон(ШаблонТекста, ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.ДокументОтсутствия);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,
				СтрШаблон("РезультатыОбучения[%1].ДокументОтсутствия", Формат(ВыделеннаяСтрока, "ЧН=0; ЧГ=0;")), , Отказ);
			Продолжить;
		КонецЕсли;
		Объект.РезультатыОбучения.Удалить(ВыделеннаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомиссия

&НаКлиенте
Процедура КомиссияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущиеДанные.РольВКомиссии = ПредопределенноеЗначение("Перечисление.РолиЧленовКомиссииОхраныТруда.ЧленКомиссии");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	ЗарплатаКадрыРасширенныйКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомиссияЧленКомиссииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Комиссия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ЧленКомиссии) Тогда
		ТекущиеДанные.Должность = ДолжностьЧленаКомиссии(ТекущиеДанные.ЧленКомиссии, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьКомиссию(Команда)
	ЗаполнитьКомиссиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодборСотрудников(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = Нстр("ru = 'Подбор возможен только при указанной организации'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.РезультатыОбучения,
		Объект.Организация,
		Объект.Подразделение,
		Объект.Дата,
		Истина,
		АдресСпискаПодобранныхСотрудников());
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ОбучениеСотрудников) И Объект.Проведен Тогда
		ТекстПредупреждения = НСтр("ru = 'Перед заполнением сотрудников необходимо отменить проведение документа.'");
		ПоказатьПредупреждение(, ТекстПредупреждения, , НСтр("ru = 'Нужно отменить проведение документа'"));
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСотрудниковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатыПроверкиЗнанияДляВсехСотрудников(Команда)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ЗаполнениеВсехСотрудников", Истина);
	
	ПоказатьРезультатыПроверкиЗнанийДляВыбора(ПараметрыОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатыПроверкиЗнанияДляВыделенныхСотрудников(Команда)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ЗаполнениеВсехСотрудников", Ложь);
	ПараметрыОповещения.Вставить("ВыделенныеСтроки", Элементы.РезультатыОбучения.ВыделенныеСтроки);
	
	ПоказатьРезультатыПроверкиЗнанийДляВыбора(ПараметрыОповещения);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
	ЗарплатаКадрыРасширенныйКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
	ВыбранноеОбучениеСотрудников = Объект.ОбучениеСотрудников;
	
	НастроитьФорму();
	ЗаполнитьДокументыОтсутствия();
	УстановитьОтображениеНомераПротокола(ЭтотОбъект);
	
КонецПроцедуры

#Область СерверныеОбработчикиСобытийФормы

&НаСервере
Процедура ОбучениеСотрудниковПриИзмененииНаСервере()
	
	ЗаполнитьПоОснованиюНаСервере(Объект.ОбучениеСотрудников);
	Модифицированность = Истина;
	ЗаполнитьКомиссиюНаСервере();
	
	НастроитьПоФормеОбучения();
	
КонецПроцедуры

&НаСервере
Процедура ПрограммаОбученияПриИзмененииНаСервере()
	
	ЗаполнитьПоОснованиюНаСервере(Объект.ПрограммаОбучения);
	Модифицированность = Истина;
	ЗаполнитьСоставКомиссии(Объект.ФормаОбучения, Объект.Комиссия, Объект.Организация, Объект.Подразделение);
	
	НастроитьПоФормеОбучения();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСоставКомиссии(ФормаОбучения, Комиссия, Организация, Подразделение)
	
	Комиссия.Очистить();
	
	Если ФормаОбучения <> Перечисления.ФормыОбученияПоОхранеТруда.Внутренняя Тогда
		Возврат;
	КонецЕсли;
	
	ОхранаТруда.ЗаполнитьСоставКомиссии(Комиссия, Организация, Подразделение, "ПроверкаЗнанияТребованийОхраныТруда");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомиссиюНаСервере()
	
	Объект.Комиссия.Очистить();
	ЗаполнитьСоставКомиссии(Объект.ФормаОбучения, Объект.Комиссия, Объект.Организация, Объект.Подразделение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
	
	Объект.РезультатыОбучения.Очистить();
	Объект.ФизическиеЛица.Очистить();
	
	Если ЗначениеЗаполнено(Объект.ОбучениеСотрудников) Тогда
		ЗаполнитьПоОснованиюНаСервере(Объект.ОбучениеСотрудников);
	Иначе
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗаполнитьСотрудниковПоПрограммеОбучения();
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект")
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РезультатыОбученияСотрудникПриИзмененииНаСервере(ИдентификаторСтроки)
	
	Строка = Объект.РезультатыОбучения.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Строка.ФизическоеЛицо), "Должность");
	
	Если КадровыеДанныеСотрудника.Количество() > 0 Тогда
		Строка.Должность = КадровыеДанныеСотрудника[0].Должность;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтрисовкаФормы

&НаСервере
Процедура НастроитьФорму()
	
	НастроитьПоОбучениюСотрудников();
	НастроитьПоФормеОбучения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДокументаОтсутствия()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"РезультатыОбученияДокументОтсутствия",
		"Видимость",
		ПравоДоступа("Чтение", Метаданные.Документы.ОплатаПоСреднемуЗаработкуСписком));
	
КонецПроцедуры

#Область НастроитьПоФормеОбучения

&НаСервере
Процедура НастроитьПоФормеОбучения()
	
	ЭтоВнутренняяФормаОбучения = Объект.ФормаОбучения = Перечисления.ФормыОбученияПоОхранеТруда.Внутренняя;
	
	УстановитьВидимостьКомиссии(ЭтоВнутренняяФормаОбучения);
	УстановитьВидимостьЗакладок(ЭтоВнутренняяФормаОбучения);
	
	ОбучениеПоОхранеТрудаФормыКлиентСервер.ОбновитьСвойстваЭлементов(
		ЭтотОбъект, Новый Структура("ЭтоВнешняяФормаОбучения", Не ЭтоВнутренняяФормаОбучения));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЗакладок(ОтображатьКомиссию)
	Если ОтображатьКомиссию Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "Страницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.ЗакладкиСверху);
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "Страницы", "ОтображениеСтраниц", ОтображениеСтраницФормы.Нет);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомиссии(ОтображатьКомиссию)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницаКомиссия", "Видимость", ОтображатьКомиссию);
КонецПроцедуры

#КонецОбласти

#Область НастроитьПоОбучениюСотрудников

&НаСервере
Процедура НастроитьПоОбучениюСотрудников()
	
	ВыбраноОбучение = ЗначениеЗаполнено(Объект.ОбучениеСотрудников);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаФормаПрограммаОбучения", "ТолькоПросмотр", ВыбраноОбучение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПериодОбучения", "ТолькоПросмотр", ВыбраноОбучение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаУчебноеЗаведение", "ТолькоПросмотр", ВыбраноОбучение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "РезультатыОбучения", "ИзменятьСоставСтрок", Не ВыбраноОбучение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "РезультатыОбученияПодборСотрудников", "Доступность", Не ВыбраноОбучение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДатаНачалаОбучения", "Видимость", Не ВыбраноОбучение);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДатаОкончанияОбучения", "Видимость", Не ВыбраноОбучение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КлючевыеРеквизитыЗаполненияФормы

// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	КлючевыеРеквизиты = Новый Массив;
	КлючевыеРеквизиты.Добавить("Объект.РезультатыОбучения");
	КлючевыеРеквизиты.Добавить("Объект.Комиссия");
	
	Возврат КлючевыеРеквизиты;
	
КонецФункции 

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	КлючевыеРеквизиты = Новый Массив;
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация",		 НСтр("ru = 'организации'")));
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "ФормаОбучения",		 НСтр("ru = 'формы обучения'")));
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "ОбучениеСотрудников", НСтр("ru = 'обучения сотрудников'")));
	
	Возврат КлючевыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ПодборСотрудников

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	МассивФизическихЛиц = Объект.РезультатыОбучения.Выгрузить(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо");
	СотрудникиФизическихЛиц = КадровыйУчетРасширенный.СотрудникиФизическихЛиц(
		МассивФизическихЛиц, Объект.Организация, Истина, Истина);
	
	Возврат ПоместитьВоВременноеХранилище(СотрудникиФизическихЛиц, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура СотрудникиОбработкаВыбораНаСервере(ВыбранныеСотрудники)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	КадровыеДанныеСотрудников =
		РабочиеМестаОхраныТрудаФормы.КадровыеДанныеПодобранныхСотрудников(ЭтотОбъект, ВыбранныеСотрудники, ТекущийОбъект);
	Если КадровыеДанныеСотрудников.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.ЗаполнитьСотрудниковПоПрограммеОбучения(КадровыеДанныеСотрудников);
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);
	ЗаполнитьДокументыОтсутствия();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
// Проверяет наличие данных в реквизитах, предназначенных для заполнения.
Функция РеквизитыКЗаполнениюЗаняты()
	
	Возврат ЗначениеЗаполнено(Объект.КоличествоУчебныхЧасов)
		ИЛИ ЗначениеЗаполнено(Объект.УчебноеЗаведение)
		ИЛИ ЗначениеЗаполнено(Объект.Контрагент);
	
КонецФункции

&НаКлиенте
Процедура ПрограммаОбученияПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПрограммаОбученияПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованиюНаСервере(ДанныеЗаполнения)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыОтсутствия()
	
	УстановитьВидимостьДокументаОтсутствия();
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеПроверки = Документы.ПроверкаЗнанияТребованийОхраныТруда.ДанныеПроверки(Объект.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДанныеПроверки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаРезультат Из Объект.РезультатыОбучения Цикл
		Отбор = Новый Структура("ФизическоеЛицо, РабочееМесто", СтрокаРезультат.ФизическоеЛицо, СтрокаРезультат.РабочееМесто);
		НайденныеСтроки = ДанныеПроверки.НайтиСтроки(Отбор);
		СтрокаРезультат.ДокументОтсутствия =
			?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].ДокументОтсутствия, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДолжностьЧленаКомиссии(ЧленКомиссии, Дата)
	Возврат ОхранаТруда.ДолжностьЧленаКомиссии(ЧленКомиссии, Неопределено, Дата);
КонецФункции

&НаКлиенте
Процедура ПоказатьРезультатыПроверкиЗнанийДляВыбора(ПараметрыОповещения)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьРезультатПроверкиЗнанияПослеВыбораЗначения", ЭтотОбъект, ПараметрыОповещения);
	ЗначениеУдовлетворительно = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
		"Перечисление.РезультатыПроверкиЗнанияПоОхранеТруда.Удовлетворительно");
	Подсказка = НСтр("ru = 'Выберите результат проверки знания'");
	ПоказатьВводЗначения(Оповещение, ЗначениеУдовлетворительно, Подсказка, ТипЗнч(ЗначениеУдовлетворительно));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатПроверкиЗнанияПослеВыбораЗначения(Значение, ДополнительныеПараметры) Экспорт
	
	Если Значение = Неопределено Или ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ЗаполнениеВсехСотрудников Тогда
		Для Каждого СтрокаРезультата Из Объект.РезультатыОбучения Цикл
			СтрокаРезультата.РезультатПроверкиЗнания = Значение;
		КонецЦикла;
	Иначе
		Для Каждого ВыделеннаяСтрока Из ДополнительныеПараметры.ВыделенныеСтроки Цикл
			НайденнаяСтрока = Объект.РезультатыОбучения.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НайденнаяСтрока.РезультатПроверкиЗнания = Значение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область ПроцессыОбработкиДокументов

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьСотрудника(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.РезультатыОбученияСотрудник Тогда
		Возврат;
	КонецЕсли;
	
	Сотрудник = СотрудникПоФизическомуЛицу(ТекущиеДанные["ФизическоеЛицо"], ТекущиеДанные["РабочееМесто"], Объект.Организация);
	
	ПоказатьЗначение(, Сотрудник);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация)
	
	Возврат ОхранаТруда.СотрудникПоФизическомуЛицу(ФизическоеЛицо, РабочееМесто, Организация);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьРабочееМесто(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.РезультатыОбученияРабочееМесто Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = ТекущиеДанные.РабочееМесто;
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.РабочиеМестаОхраныТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбучение(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.РезультатыОбученияОбучение
	 Или Поле <> Элементы.РезультатыОбученияДатаНачалаОбучения
	 Или Поле <> Элементы.РезультатыОбученияДатаОкончанияОбучения Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = ТекущиеДанные.Обучение;
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ОбучениеСотрудниковОхранеТруда.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументОтсутствия(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.РезультатыОбученияДокументОтсутствия Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ,ФизическоеЛицо");
	ПараметрыФормы.Ключ = ТекущиеДанные.ДокументОтсутствия;
	ПараметрыФормы.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ОплатаПоСреднемуЗаработкуСписком.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеНомераПротокола(УправляемаяФорма)
	ЗарплатаКадрыКлиентСервер.УстановитьОтображениеНомеровДокумента(УправляемаяФорма, "НомерПротоколаПроверкиЗнания");
КонецПроцедуры

#КонецОбласти
